export const mob = () => {
  return (
    <div className="flex bg-[#000] w-full h-screen items-center justify-center bg-opacity-50">
      <div className="w-[1077px] h-[904px] pt-[83px] pb-[70px] pl-[149px] pr-[156px] rounded-[62px] bg-[#f0f0f0] relative">
        <svg
          width="40"
          height="30"
          viewBox="0 0 40 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
          preserveAspectRatio="none"
          className="absolute top-[43px] left-[61px]"
        >
          <path
            d="M3.07158 11.6414L1.53579 13.0836L0 11.6414L1.53579 10.1992L3.07158 11.6414ZM40 27.9602C40 28.5012 39.7711 29.02 39.3638 29.4025C38.9564 29.7851 38.4039 30 37.8277 30C37.2516 30 36.6991 29.7851 36.2917 29.4025C35.8843 29.02 35.6555 28.5012 35.6555 27.9602H40ZM12.3971 23.2828L1.53579 13.0836L4.60736 10.1992L15.4687 20.3984L12.3971 23.2828ZM1.53579 10.1992L12.3971 0L15.4687 2.88434L4.60736 13.0836L1.53579 10.1992ZM3.07158 9.60155H24.7942V13.6812H3.07158V9.60155ZM40 23.8805V27.9602H35.6555V23.8805H40ZM24.7942 9.60155C28.827 9.60155 32.6947 11.1059 35.5463 13.7837C38.398 16.4616 40 20.0935 40 23.8805H35.6555C35.6555 21.1755 34.5112 18.5812 32.4743 16.6685C30.4374 14.7558 27.6748 13.6812 24.7942 13.6812V9.60155Z"
            fill="black"
          ></path>
        </svg>
        <p className="text-[32px] font-medium text-center text-black">
          Поставување на вашиот телефон
        </p>
        <div className="flex flex-col gap-[10px] items-start mt-[46px]">
          <p className="text-2xl text-center text-black">
            Внесете го вашиот телефонски број
          </p>
          <div className="relative">
            <div className="w-[102px] h-[72px] flex gap-[7px] justify-center items-center bg-[#d9d9d9] border border-[#636363] absolute">
              <svg
                width="46"
                height="29"
                viewBox="0 0 46 29"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="w-[46px] h-[28.89px]"
                preserveAspectRatio="none"
              >
                <path
                  d="M44.2341 1.10889L40.8889 1.11111L38.9722 0H25.5556L23 1.11111L20.4444 0H7.02778L5.11111 1.11111L1.76589 1.10889C1.2135 1.5221 0.769879 2.03387 0.465173 2.60943C0.160466 3.18498 0.00181478 3.81083 0 4.44444L0 11.6667L1.27778 14.4444L0 17.2222V24.4444C0 25.7811 0.692556 26.9656 1.76589 27.78L5.11111 27.7778L7.02778 28.8889H20.4444L23 27.7778L25.5556 28.8889H38.9722L40.8889 27.7778L44.2341 27.78C44.7865 27.3668 45.2301 26.855 45.5348 26.2795C45.8395 25.7039 45.9982 25.0781 46 24.4444V17.2222L44.7222 14.4444L46 11.6667V4.44444C45.9982 3.81083 45.8395 3.18498 45.5348 2.60943C45.2301 2.03387 44.7865 1.5221 44.2341 1.10889Z"
                  fill="#D20000"
                ></path>
                <path
                  d="M46 17.2222V11.6667L28.5187 13.7778C28.3971 12.9929 28.0553 12.2462 27.5233 11.6033L44.2507 1.09778C43.3208 0.388721 42.1257 -0.00152922 40.8889 4.5036e-06H38.9722L26.6251 10.7678C25.7644 10.1247 24.6976 9.72679 23.5686 9.62778L25.5556 4.5036e-06H20.4444L22.4314 9.62778C21.3023 9.72657 20.2354 10.1245 19.3749 10.7678L7.02778 4.5036e-06H5.11111C3.87395 -0.00139206 2.67851 0.388823 1.748 1.09778L18.4767 11.6033C17.9447 12.2462 17.6029 12.9929 17.4813 13.7778L0 11.6667V17.2222L17.4813 15.1111C17.6103 15.9156 17.9528 16.6567 18.4767 17.2856L1.748 27.7911L1.74928 27.7922C2.67946 28.5008 3.8745 28.8906 5.11111 28.8889H7.02778L19.3749 18.1211C20.2356 18.7642 21.3024 19.1621 22.4314 19.2611L20.4444 28.8889H25.5556L23.5686 19.2611C24.6977 19.1623 25.7646 18.7644 26.6251 18.1211L38.9722 28.8889H40.8889C42.1261 28.8905 43.3216 28.5002 44.252 27.7911L27.5233 17.2856C28.0472 16.6567 28.3897 15.9156 28.5187 15.1111L46 17.2222Z"
                  fill="#FFE600"
                ></path>
                <path
                  d="M23 9C19.8296 9 17.25 11.4675 17.25 14.5C17.25 17.5325 19.8296 20 23 20C26.1704 20 28.75 17.5325 28.75 14.5C28.75 11.4675 26.1704 9 23 9ZM23 18.7154C20.57 18.7154 18.593 16.8243 18.593 14.5C18.593 12.1757 20.57 10.2846 23 10.2846C25.43 10.2846 27.407 12.1757 27.407 14.5C27.407 16.8243 25.43 18.7154 23 18.7154Z"
                  fill="#D20000"
                ></path>
              </svg>
              <svg
                width="19"
                height="12"
                viewBox="0 0 19 12"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                preserveAspectRatio="none"
              >
                <path
                  d="M9.14067 7.9846L9.5 8.35598L9.85933 7.9846L16.8892 0.719058L18.3043 2.18154L9.5 11.2809L0.695733 2.18154L2.11078 0.719058L9.14067 7.9846Z"
                  fill="black"
                  stroke="#636363"
                ></path>
              </svg>
            </div>
            <input
              type="text"
              className="w-[772px] h-[72px] pl-[115px] bg-[#f4f4f4] border border-[#636363] text-2xl text-[#000]"
              placeholder="+389 77 777 777"
            />
          </div>
        </div>
        <div className="mt-[67px] flex flex-col gap-[10px]">
          <p className="text-2xl text-black">
            Селектирај која било опција за да добиете код
          </p>
          <div className="w-full bg-[#f4f4f4] border border-[#636363]">
            <div className="flex items-center gap-[55px] p-[32px]">
              <svg
                width="62"
                height="49"
                viewBox="0 0 62 49"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="w-[61.78px] h-[49px]"
                preserveAspectRatio="none"
              >
                <path
                  d="M0 18.1094V42.8224C0 44.461 0.650922 46.0325 1.80957 47.1911C2.96822 48.3498 4.53968 49.0007 6.17826 49.0007H55.6044C57.2429 49.0007 58.8144 48.3498 59.973 47.1911C61.1317 46.0325 61.7826 44.461 61.7826 42.8224V18.1094L30.8913 30.4659L0 18.1094Z"
                  fill="#01A180"
                ></path>
                <path
                  d="M6.17826 0C4.53968 0 2.96822 0.64531 1.80957 1.79397C0.650922 2.94263 0 4.50055 0 6.125L0 12.25L30.8913 24.5L61.7826 12.25V6.125C61.7826 4.50055 61.1317 2.94263 59.973 1.79397C58.8144 0.64531 57.2429 0 55.6044 0H6.17826Z"
                  fill="#01A180"
                ></path>
              </svg>
              <div>
                <p className="text-[32px] font-bold text-black">Е-маил</p>
                <p className="text-2xl text-black">Примање код преку мејл</p>
              </div>
            </div>
          </div>
        </div>
        <div className="w-full flex items-center justify-center mt-[60px]">
          <svg
            width="152"
            height="152"
            viewBox="0 0 152 152"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            className="w-[152px] h-[152px]"
            preserveAspectRatio="none"
          >
            <circle cx="76" cy="76" r="76" fill="#01A180"></circle>
            <path
              d="M42.1061 82.0232L50.768 73.235L62.5623 85.2367L63.6311 86.3243L64.701 85.2377L101.231 48.1374L109.894 56.9266L63.6321 103.863L42.1061 82.0232Z"
              fill="white"
              stroke="#01A180"
              stroke-width="3"
            ></path>
          </svg>
        </div>
      </div>
    </div>
  );
};
